---
kind: type
id: T:Autodesk.Revit.DB.ExternallyTaggedGeometryObject
source: html/f9d2835b-5b7d-4e3c-e969-8d1d6d25fedd.htm
---
# Autodesk.Revit.DB.ExternallyTaggedGeometryObject

Base class for ExternallyTaggedGeometryObject and ExternallyTaggedSolid.

## Syntax (C#)
```csharp
public class ExternallyTaggedGeometryObject : IDisposable
```